%%计算均值方差等
function Operation(x)
n=length(x);

xmean=mean(x);%均值
disp(['均值为:',num2str(xmean)]);
xvar=var(x);%方差
disp(['方差为:',num2str(xvar)]);
xstd=std(x);%标准差
disp(['标准差为:',num2str(xstd)]);
xSEmean=xstd./sqrt(n);%均值标准差
disp(['均值标准差为:',num2str(xSEmean)]);
xcv=100*std(x)./mean(x);%变异系数
disp(['变异系数为:',num2str(xcv)]);
xske=skewness(x,0);%偏度
disp(['偏度为:',num2str(xske)]);
xkur=kurtosis(x,0);%峰度
disp(['峰度为:',num2str(xkur)]);
xmed=median(x);%中位数
disp(['中位数为:',num2str(xmed)]);
x75=prctile(x,75);%上四分位数
x25=prctile(x,25);%下四分位数
extreme=range(x);%极差
xr=x75-x25;%四分位极差
disp(['上、下四分位数:',num2str(x75),'  ',num2str(x25)]);
disp(['极差为：',num2str(extreme)]);
disp(['四分位极差为：',num2str(xr)]);


% x1=[16770
% 10564
% 4945
% 4843
% 5800
% 6929
% 5710
% 5141
% 20944
% 8302
% 11161
% 4441
% 7826
% 4173
% 7025
% 4632
% 5533
% 5498
% 10829
% 4330
% 4736
% 5417
% 4501
% 3499
% 4075
% 2915
% 3972
% 3810
% 4229
% 5112
% 4206];
% x2=[7655
% 4771
% 2725
% 2447
% 2816
% 3458
% 2969
% 2552
% 10136
% 4915
% 6301
% 2445
% 4290
% 2810
% 3537
% 2666
% 2832
% 3072
% 4205
% 2483
% 2792
% 2341
% 2572
% 1630
% 2145
% 1827
% 2201
% 1883
% 2128
% 2437
% 2000];
% x3=[18508
% 12554
% 9008
% 8076
% 9043
% 9357
% 8166
% 7410
% 22294
% 11530
% 15877
% 7942
% 11710
% 7950
% 11193
% 8894
% 9041
% 9480
% 14913
% 7894
% 7688
% 9032
% 8305
% 8507
% 8579
% 7312
% 9033
% 8190
% 7481
% 8711
% 7875];



